# **File Handling**

In [28]:
import pandas as pd
import numpy as np

In [29]:


# 1. Create the merged dataset directly
df = pd.DataFrame({
    'EmpID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 101, 112],
    'Name': ['Ali', 'Sara', 'Ahmed', 'Zara', 'Usman', 'Hina', 'Bilal', 'Nida', np.nan, 'Omer', 'Ali', 'Tariq'],
    'Dept': ['IT', 'HR', 'IT', 'Finance', 'HR', 'IT', 'HR', 'it', 'Finance', 'Marketing', 'IT', 'Sales'],
    'Age': [22, 29, 24, 31, 26, 23, 28, 30, np.nan, 25, 22, 45],
    'Salary': [45000, 52000, 48000, 60000, 50000, 47000, '55000', '62,000', '58000', np.nan, 45000, '70000'],
    'Experience': [1, 5, 2, 7, 3, 1, 4, 6, 8, 2, 1, 15]
})

## Write CSV

In [30]:
# df.to_csv('Data.csv',index=False)

## Read CSV

In [31]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID   Name       Dept   Age  Salary  Experience
0     101    Ali         IT  22.0   45000           1
1     102   Sara         HR  29.0   52000           5
2     103  Ahmed         IT  24.0   48000           2
3     104   Zara    Finance  31.0   60000           7
4     105  Usman         HR  26.0   50000           3
5     106   Hina         IT  23.0   47000           1
6     107  Bilal         HR  28.0   55000           4
7     108   Nida         it  30.0  62,000           6
8     109    NaN    Finance   NaN   58000           8
9     110   Omer  Marketing  25.0     NaN           2
10    101    Ali         IT  22.0   45000           1
11    112  Tariq      Sales  45.0   70000          15

## nrows (Number Of Rows)

In [32]:
firstRow=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',nrows=1)
firstRow

   EmpID Name Dept   Age  Salary  Experience
0    101  Ali   IT  22.0   45000           1

## usecols=['col1','col2'] : For Selecting Particular columns 
    Column Indexes can also be passed instead of column names (e.g., usecols=[0,1,5])

In [33]:
columns=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',usecols=['EmpID','Name','Experience'])
# columns=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',usecols=[0,1,5])

columns

    EmpID   Name  Experience
0     101    Ali           1
1     102   Sara           5
2     103  Ahmed           2
3     104   Zara           7
4     105  Usman           3
5     106   Hina           1
6     107  Bilal           4
7     108   Nida           6
8     109    NaN           8
9     110   Omer           2
10    101    Ali           1
11    112  Tariq          15

## skiprows=[Row Indexes] : To skip indexes

In [34]:
skipRows=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',skiprows=[0,3])
skipRows

   101    Ali         IT  22.0   45000   1
0  102   Sara         HR  29.0   52000   5
1  104   Zara    Finance  31.0   60000   7
2  105  Usman         HR  26.0   50000   3
3  106   Hina         IT  23.0   47000   1
4  107  Bilal         HR  28.0   55000   4
5  108   Nida         it  30.0  62,000   6
6  109    NaN    Finance   NaN   58000   8
7  110   Omer  Marketing  25.0     NaN   2
8  101    Ali         IT  22.0   45000   1
9  112  Tariq      Sales  45.0   70000  15

## Change Index Column
    Assign another column as index column
```python 
index_col='Column Name'
```

In [35]:
indexCol=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',index_col='EmpID')
indexCol

        Name       Dept   Age  Salary  Experience
EmpID
101      Ali         IT  22.0   45000           1
102     Sara         HR  29.0   52000           5
103    Ahmed         IT  24.0   48000           2
104     Zara    Finance  31.0   60000           7
105    Usman         HR  26.0   50000           3
106     Hina         IT  23.0   47000           1
107    Bilal         HR  28.0   55000           4
108     Nida         it  30.0  62,000           6
109      NaN    Finance   NaN   58000           8
110     Omer  Marketing  25.0     NaN           2
101      Ali         IT  22.0   45000           1
112    Tariq      Sales  45.0   70000          15

## Make Row a Header
``` python 
header = Row Index
```

In [40]:
RowHeader=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',header= 2 )
RowHeader

   102   Sara         HR  29.0   52000   5
0  103  Ahmed         IT  24.0   48000   2
1  104   Zara    Finance  31.0   60000   7
2  105  Usman         HR  26.0   50000   3
3  106   Hina         IT  23.0   47000   1
4  107  Bilal         HR  28.0   55000   4
5  108   Nida         it  30.0  62,000   6
6  109    NaN    Finance   NaN   58000   8
7  110   Omer  Marketing  25.0     NaN   2
8  101    Ali         IT  22.0   45000   1
9  112  Tariq      Sales  45.0   70000  15

## Custom Header Name
``` python
names=['New Names']
```

In [41]:
ColumnHeading=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',names=['Col1','Col2','Col3','Col4','Col5','Col6'])
ColumnHeading

     Col1   Col2       Col3  Col4    Col5        Col6
0   EmpID   Name       Dept   Age  Salary  Experience
1     101    Ali         IT  22.0   45000           1
2     102   Sara         HR  29.0   52000           5
3     103  Ahmed         IT  24.0   48000           2
4     104   Zara    Finance  31.0   60000           7
5     105  Usman         HR  26.0   50000           3
6     106   Hina         IT  23.0   47000           1
7     107  Bilal         HR  28.0   55000           4
8     108   Nida         it  30.0  62,000           6
9     109    NaN    Finance   NaN   58000           8
10    110   Omer  Marketing  25.0     NaN           2
11    101    Ali         IT  22.0   45000           1
12    112  Tariq      Sales  45.0   70000          15

## Add Headers (Prefix)

```python
df=df.add_prefix('Col')
```

In [56]:
addHeaders=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',header=None )
addHeaders=addHeaders.add_prefix('Col')
addHeaders

     Col0   Col1       Col2  Col3    Col4        Col5
0   EmpID   Name       Dept   Age  Salary  Experience
1     101    Ali         IT  22.0   45000           1
2     102   Sara         HR  29.0   52000           5
3     103  Ahmed         IT  24.0   48000           2
4     104   Zara    Finance  31.0   60000           7
5     105  Usman         HR  26.0   50000           3
6     106   Hina         IT  23.0   47000           1
7     107  Bilal         HR  28.0   55000           4
8     108   Nida         it  30.0  62,000           6
9     109    NaN    Finance   NaN   58000           8
10    110   Omer  Marketing  25.0     NaN           2
11    101    Ali         IT  22.0   45000           1
12    112  Tariq      Sales  45.0   70000          15

## Type()

In [36]:
type(firstRow)

pandas.core.frame.DataFrame

## dtypes : Data types of columns

In [37]:
firstRow.dtypes

EmpID           int64
Name           object
Dept           object
Age           float64
Salary          int64
Experience      int64
dtype: object

## Change dtype of Column
```python
```

In [66]:
changeDtype=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv',dtype={"Age":"Int64"})
changeDtype

    EmpID   Name       Dept   Age  Salary  Experience
0     101    Ali         IT    22   45000           1
1     102   Sara         HR    29   52000           5
2     103  Ahmed         IT    24   48000           2
3     104   Zara    Finance    31   60000           7
4     105  Usman         HR    26   50000           3
5     106   Hina         IT    23   47000           1
6     107  Bilal         HR    28   55000           4
7     108   Nida         it    30  62,000           6
8     109    NaN    Finance  <NA>   58000           8
9     110   Omer  Marketing    25     NaN           2
10    101    Ali         IT    22   45000           1
11    112  Tariq      Sales    45   70000          15

# CSV Functions

In [68]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [69]:
df.columns

Index(['EmpID', 'Name', 'Dept', 'Age', 'Salary', 'Experience'], dtype='object')

In [71]:
df.describe()

            EmpID        Age  Experience
count   12.000000  11.000000   12.000000
mean   105.666667  27.727273    4.583333
std      3.626502   6.543560    4.077841
min    101.000000  22.000000    1.000000
25%    102.750000  23.500000    1.750000
50%    105.500000  26.000000    3.500000
75%    108.250000  29.500000    6.250000
max    112.000000  45.000000   15.000000

In [72]:
df.head()

   EmpID   Name     Dept   Age Salary  Experience
0    101    Ali       IT  22.0  45000           1
1    102   Sara       HR  29.0  52000           5
2    103  Ahmed       IT  24.0  48000           2
3    104   Zara  Finance  31.0  60000           7
4    105  Usman       HR  26.0  50000           3

In [73]:
df.tail()

    EmpID   Name       Dept   Age  Salary  Experience
7     108   Nida         it  30.0  62,000           6
8     109    NaN    Finance   NaN   58000           8
9     110   Omer  Marketing  25.0     NaN           2
10    101    Ali         IT  22.0   45000           1
11    112  Tariq      Sales  45.0   70000          15

In [74]:
df.iloc[7]["Name"]

'Nida'